cf/InformationRegisters/ОбращенияВТехПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОбращенияВТехПоддержку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленоДляИзменения</Name>
					<Comment>вспомогательный ресурс, нужен из-за нумерации. Когда Элемент новый он уже получает номер, но может быть в дальнейшейм не записан. Пока элемент новый но ни разу не записан - у него это свойство ЛОЖЬ, по нему фильтр, что бы в общем списке такие заявки не по</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращенийВТехПоддержку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбращенийВТехПоддержку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ТипыОбращенийВТехПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыОбращенийВТехПоддержку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеДанных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/InformationRegisters/ОбращенияВТехПоддержку/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Перем БылаЗапись; // контролирует была ли нажата кнопка "Записать". Если для нового элемента НЕ была нажата кнорка "Записать" - то надо удалить эту запись из базы, т.к. она пустая, была создана для выдачи номера.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КнопкаОтправить.Видимость 	= Не ТолькоПросмотр;
	
	Если Запись.Дата = '00010101' Тогда ЭтоНовый = Истина;
		
		Запрос = Новый Запрос("ВЫБРАТЬ МАКСИМУМ(Номер) ПоследнийНомер ИЗ РегистрСведений.ОбращенияВТехПоддержку");
		Выборка = Запрос.Выполнить().Выбрать();
		Номер = 1;
		Если Выборка.Следующий() Тогда
			Номер = Выборка.ПоследнийНомер + Номер;
		КонецЕсли;
		
		Запись.Номер = Номер;
		Запись.Дата = ТекущаяДата();
		Запись.Заявитель = ПараметрыСеанса.ТекущийПользователь;
		
		Попытка
			Записать();	
		Исключение
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;	
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.ОбращенияВТехПоддержку.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	МенеджерЗаписи.Удалить();

КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ БылаЗапись И ЭтоНовый Тогда
		
		ПередЗакрытиемНаСервере();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	БылаЗапись = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	БылаЗапись = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДляИзменения(Команда)
	Запись.ОтправленоДляИзменения = Истина;
	Если Записать() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	Запись.Выполнено = Истина;
	Запись.Исполнитель = НастройкиПользователя.ТекущийПользователь();
	Запись.ДатаВыполнения = ТекущаяДата();
	Если ПроверитьЗаполнение() Тогда	
			ТекстОшибки = "";
			Если ОтправкаПисьмаЗаявителю(ТекстОшибки) Тогда
				ПоказатьОповещениеПользователя(,,"Письмо заявителю успешно отправлено");
				Записать()
			Иначе
				ПоказатьОповещениеПользователя(,,ТекстОшибки);
				
				Возврат
			КонецЕсли;
			Закрыть();
	КонецЕсли;
КонецПроцедуры

Функция  ОтправкаПисьмаЗаявителю(ТекстОшибки)
	// Адрес заявителя
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	//УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("POSTMAN");
	АдресаЗявителя = Запись.Заявитель.Почта;
	Попытка
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", АдресаЗявителя);
		ПараметрыПисьма.Вставить("Тема", "Заявка на изменение данных в 1С");
		Текст = "Добрый день! &ПС
		|Заявка №&Номер от &Дата0  (&Заказ) по проблеме &Описание выполнена :&ПС
		| &Исполнитель &ПС
		| &Комментарий &ПС
		| &ДатаВыполнения.&ПС
		|&ПС
		|Спасибо за обращение!";
		
		Текст = СтрЗаменить(Текст,"&ПС",Символы.ПС);
		Текст = СтрЗаменить(Текст,"&Номер",Запись.Номер);
		Текст = СтрЗаменить(Текст,"&Дата0",Запись.Дата);
		Текст = СтрЗаменить(Текст,"&Заказ",Запись.Заказ);
		Текст = СтрЗаменить(Текст,"&Описание",Запись.Описание);
		Текст = СтрЗаменить(Текст,"&Исполнитель",Запись.Исполнитель);
		Текст = СтрЗаменить(Текст,"&Комментарий",Запись.Комментарий);
		Текст = СтрЗаменить(Текст,"&ДатаВыполнения",Запись.ДатаВыполнения);
		ПараметрыПисьма.Вставить("Тело", Текст); 
		ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ТекстОшибки = "Не удалось отправить письмо заявителю/" + ОписаниеОшибки();
		Возврат Ложь;		
	КонецПопытки;
	Возврат Истина;

КонецФункции	


&НаКлиенте
Процедура ОтдатьВРазборку(Команда)
	Парам = Новый Структура("Заказ",Запись.Заказ);
	ОткрытьФорму("БизнесПроцесс.ОтменаСборки.Форма.Задача_СоздатьЗаданияНаРазборку",Парам);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.ГруппаОтправить.Видимость = ЭтоНовый;
	Элементы.КнопкаОтправить.КнопкаПоУмолчанию = ЭтоНовый;
	
	Элементы.Описание.ТолькоПросмотр = Запись.Выполнено;
	Элементы.Заказ.ТолькоПросмотр = Запись.Выполнено;
	Элементы.ТипЗапроса.ТолькоПросмотр = Запись.Выполнено;
	Элементы.ТипЗаявки.ТолькоПросмотр = Запись.Выполнено;
	ЭтоИсполнитель = РольДоступна("ПолныеПраваВОбласти") ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("УправлениеСборкойЗаказа");
	
	Элементы.Готово.Видимость = НЕ ЭтоНовый И НЕ Запись.Выполнено И ЭтоИсполнитель;
	Элементы.Записать.Видимость = НЕ ЭтоНовый;
	
	Элементы.ГруппаКомментарий.ТолькоПросмотр = НЕ ЭтоИсполнитель;
	
	Элементы.ОтдатьВРазборку.Видимость = НЕ ЭтоНовый И НЕ Запись.Выполнено И ЭтоИсполнитель И Запись.ТипЗаявки = ПредопределенноеЗначение("Перечисление.ТипыОбращенийВТехПоддержку.ЗапросНаСклад") ;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаявкиПриИзменении(Элемент)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры
